[
    {
      "id": 1,
      "title": "Kalima Tayyibah",
      "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ مُحَمَّدٌ رَسُوْلُ اللّٰهِ",
      "urdu": "اللہ کے سوا کوئی معبود نہیں، محمد ﷺ اللہ کے رسول ہیں۔",
      "english": "There is no god but Allah, Muhammad (PBUH) is the Messenger of Allah."
    },
    {
      "id": 2,
      "title": "Kalima Shahadah",
      "arabic": "أَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُوْلُهُ",
      "urdu": "میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں، اور میں گواہی دیتا ہوں کہ محمد ﷺ اس کے بندے اور رسول ہیں۔",
      "english": "I bear witness that there is no god but Allah, He is One and has no partner, and I bear witness that Muhammad (PBUH) is His servant and Messenger."
    },
    {
      "id": 3,
      "title": "Kalima Tamjeed",
      "arabic": "سُبْحَانَ اللّٰهِ وَالْحَمْدُ لِلّٰهِ وَلَا إِلٰهَ إِلَّا اللّٰهُ وَاللّٰهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ الْعَلِيِّ الْعَظِيْمِ",
      "urdu": "اللہ پاک ہے، تمام تعریفیں اللہ کے لیے ہیں، اللہ کے سوا کوئی معبود نہیں، اللہ سب سے بڑا ہے۔ اور گناہوں سے بچنے اور نیکی کرنے کی طاقت صرف اللہ کی مدد سے ہے جو بلند اور عظمت والا ہے۔",
      "english": "Glory is to Allah, all praise is to Allah, there is no god but Allah, Allah is the Greatest. There is no power and no strength except with Allah, the Most High, the Great."
    },
    {
      "id": 4,
      "title": "Kalima Tawheed",
      "arabic": "لَا إِلٰهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، يُحْيِيْ وَيُمِيْتُ، وَهُوَ حَيٌّ لَا يَمُوْتُ أَبَدًا أَبَدًا، ذُوالْجَلَالِ وَالْإِكْرَامِ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ",
      "urdu": "اللہ کے سوا کوئی معبود نہیں، وہ اکیلا ہے، اس کا کوئی شریک نہیں، اسی کی بادشاہت ہے اور اسی کے لیے تمام تعریفیں ہیں، وہی زندہ کرتا ہے اور مارتا ہے، اور وہ ہمیشہ زندہ ہے، اسے کبھی موت نہیں آئے گی، بزرگی اور عزت والا ہے، ہر بھلائی اس کے ہاتھ میں ہے، اور وہ ہر چیز پر قادر ہے۔",
      "english": "There is no god but Allah, He is One and has no partner. His is the Kingdom and all praise is for Him. He gives life and causes death. He is Ever-living, never dies. The Majestic, the Generous. In His Hand is all good and He has power over everything."
    },
    {
      "id": 5,
      "title": "Kalima Istighfar",
      "arabic": "أَسْتَغْفِرُ اللّٰهَ رَبِّي مِنْ كُلِّ ذَنْبٍ أَذْنَبْتُهُ عَمْدًا أَوْ خَطَأً سِرًّا أَوْ عَلَانِيَةً، وَأَتُوْبُ إِلَيْهِ مِنَ الذَّنْبِ الَّذِي أَعْلَمُ وَمِنَ الذَّنْبِ الَّذِي لَا أَعْلَمُ، إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوْبِ وَسَتَّارُ الْعُيُوْبِ وَغَفَّارُ الذُّنُوْبِ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ الْعَلِيِّ الْعَظِيْمِ",
      "urdu": "میں اللہ سے بخشش مانگتا ہوں جو میرا رب ہے، ہر گناہ سے جو میں نے جان بوجھ کر یا غلطی سے، چھپ کر یا علانیہ کیا، اور میں توبہ کرتا ہوں اس گناہ سے جسے میں جانتا ہوں اور اس گناہ سے جسے میں نہیں جانتا، بے شک تو غیب جاننے والا، عیبوں کو چھپانے والا اور گناہوں کو معاف کرنے والا ہے، اور گناہوں سے بچنے اور نیکی کرنے کی طاقت صرف اللہ کی مدد سے ہے جو بلند اور عظمت والا ہے۔",
      "english": "I seek forgiveness from Allah, my Lord, for all my sins – those I committed knowingly or unknowingly, secretly or openly – and I turn to Him in repentance for the sins I know and the sins I do not know. Verily, You are the Knower of the unseen, the Concealer of faults, and the Forgiver of sins. There is no power and no strength except with Allah, the Most High, the Great."
    },
    {
      "id": 6,
      "title": "Kalima Radde Kufr",
      "arabic": "اللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ أَنْ أُشْرِكَ بِكَ شَيْئًا وَأَنَا أَعْلَمُ بِهِ، وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ بِهِ، تُبْتُ عَنْهُ وَتَبَرَّأْتُ مِنَ الْكُفْرِ وَالشِّرْكِ وَالْكِذْبِ وَالْغِيْبَةِ وَالْبِدْعَةِ وَالنَّمِيمَةِ وَالْفَوَاحِشِ وَالْبُهْتَانِ وَالْمَعَاصِي كُلِّهَا، وَأَسْلَمْتُ وَأَقُوْلُ لَا إِلٰهَ إِلَّا اللّٰهُ مُحَمَّدٌ رَسُوْلُ اللّٰهِ",
      "urdu": "اے اللہ! میں تیری پناہ مانگتا ہوں کہ میں کسی چیز کو تیرا شریک ٹھہراؤں اور میں اسے جانتا ہوں، اور میں تجھ سے بخشش مانگتا ہوں اس (شرک) سے جسے میں نہیں جانتا۔ میں نے اس سے توبہ کی اور میں کفر، شرک، جھوٹ، غیبت، بدعت، چغل خوری، بے حیائی، بہتان اور ہر گناہ سے بیزار ہوں، میں نے اسلام قبول کیا اور میں کہتا ہوں کہ اللہ کے سوا کوئی معبود نہیں، محمد ﷺ اللہ کے رسول ہیں۔",
      "english": "O Allah! I seek refuge in You from associating anything with You knowingly, and I seek Your forgiveness for that which I do unknowingly. I repent from it and I declare myself free from disbelief, polytheism, falsehood, backbiting, innovation, tale-bearing, indecency, slander, and all sins. I have accepted Islam and declare: There is no god but Allah, Muhammad (PBUH) is the Messenger of Allah."
    }
  ]
  